config/general.org
* Configuration: !start
This config has taken inspiration from the following config files.
- [[https://github.com/aaronbieber/dotfiles/tree/master/configs/emacs.d][Aaron biebers emacs config]]
- [[https://github.com/patrickt/emacs/blob/master/readme.org][Patrick Thomson's emacs config]]
- [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org][Emacs from scratch]]

** Preliminaries

I'll say it: modern Emacs Lisp is unfairly maligned. However, it was pretty fairly maligned before Emacs 24, which introduced
lexical scoping. For reasons of compatibility, it's not on by default, and the documentation states that "unlike other file-local
variables, this must be set in the first line of a file."

#+begin_src emacs-lisp
     (setq lexical-binding t)
#+end_src

Many of Emacs's defaults are ill-suited for my purposes, but the first one that needs fixing is the shockingly low
garbage-collection threshold, which defaults to a paltry *:8kb*. Setting it to *:100mb* seems to strike a nice balance between GC
pauses and performance. I also like to turn on the messages associated therewith, since thrashing GC is a good indicator of runaway
processes or similar weirdness.

#+begin_src emacs-lisp
     (setq gc-cons-threshold 100000000)
#+end_src

We use ~use-package~ everywhere (it is loaded in the [[https://github.com/patrickt/emacs/blob/master/init.el][~init.el~]] that bootstraps this whole enterprise), and by default we want it to
install all mentioned packages. There are some bugs associated with this approach, I am told, but it tends to work for me, and if I
get a message about a missing package I just call ~package-install~.

#+begin_src emacs-lisp
     (setq use-package-always-ensure t)
#+end_src

default font sizes

#+begin_src emacs-lisp
     ;; You will most likely need to adjust this font size for your system!
     (defvar mus/default-font-size 110)
     (defvar mus/default-variable-font-size 160)

     ;; Make frame transparency overridable
     (defvar mus/frame-transparency '(90 . 90))
#+end_src

*** keeping folders clean
We use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep folders where we edit files and the Emacs configuration folder clean! It knows about a wide
variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and
setting these variables yourself.

#+begin_src emacs-lisp
      (use-package no-littering)

      ;; no-littering doesn't set this by default so we must place
      ;; auto save files in the same path as it uses for sessions
      (setq auto-save-file-name-transforms
            `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

** Fixing the defaults

I dont like scrolling with the mouse and the arrow keys

#+begin_src emacs-lisp
  (global-unset-key (kbd "<left>"))
  (global-unset-key (kbd "<right>"))
  (global-unset-key (kbd "<up>"))
  (global-unset-key (kbd "<down>"))
#+end_src

Fixing Emacs's defaults is a nontrivial problem. We'll start with UI concerns.

#+begin_src emacs-lisp
  (setq
   ;; No need to see GNU agitprop.
   inhibit-startup-screen t
   ;; No need to remind me what a scratch buffer is.
   initial-scratch-message nil
   ;; Double-spaces after periods is morally wrong.
   sentence-end-double-space nil
   ;; Never ding at me, ever.
   ring-bell-function 'ignore
   ;; Prompts should go in the minibuffer, not in a GUI.
   use-dialog-box nil
   ;; Fix undo in commands affecting the mark.
   mark-even-if-inactive nil
   ;; Let C-k delete the whole line.
   kill-whole-line t
   ;; search should be case-sensitive by default
   case-fold-search nil
   ;; no need to prompt for the read command _every_ time
   compilation-read-command nil
   ;; always scroll
   compilation-scroll-output t)

       ;; Never mix tabs and spaces. Never use tabs, period.
       ;; We need the setq-default here because this becomes
       ;; a buffer-local variable when set.
       (setq-default indent-tabs-mode nil)

       (defalias 'yes-or-no-p 'y-or-n-p)       ; Accept 'y' in lieu of 'yes'.
#+end_src

It's good that Emacs supports the wide variety of file encodings it does, but UTF-8 should always, /always/ be the default.

#+begin_src emacs-lisp
     (set-charset-priority 'unicode)
     (setq locale-coding-system 'utf-8)
     (set-terminal-coding-system 'utf-8)
     (set-keyboard-coding-system 'utf-8)
     (set-selection-coding-system 'utf-8)
     (prefer-coding-system 'utf-8)
     (setq default-process-coding-system '(utf-8-unix . utf-8-unix))
#+end_src

We also need to turn on a few modes to have behavior that's even remotely modern.

#+begin_src emacs-lisp
     (delete-selection-mode t)
     (global-display-line-numbers-mode t)
     (column-number-mode)
#+end_src

Emacs 27 comes with fast current-line highlight functionality, but it can produce some visual feedback in ~vterm~ or ~ivy~ buffers,
so we only activate it in programming or text modes.

#+begin_src emacs-lisp
     (require 'hl-line)
     (add-hook 'prog-mode-hook #'hl-line-mode)
     (add-hook 'text-mode-hook #'hl-line-mode)
     ;(set-face-attribute 'hl-line nil :background "gray21")
#+end_src

Emacs is super fond of littering filesystems with backups and autosaves, since it was built with the assumption that multiple users could be using the same Emacs instance on the same filesystem. This was valid in 1980. It is no longer the case.

#+begin_src emacs-lisp
     (setq
      make-backup-files nil
      auto-save-default nil
      create-lockfiles nil)
#+end_src

By default, Emacs stores any configuration you make through its UI by writing ~custom-set-variables~ invocations to your init file, or to the file specified by ~custom-file~. Though this is convenient, it's also an excellent way to cause aggravation when the variable you keep trying to modify is being set in some ~custom-set-variables~ invocation. We can disable this by mapping it to the null device.

#+begin_src emacs-lisp
     (setq custom-file null-device)
#+end_src

However, because Emacs stores theme-safety information in that file, we have to disable the warnings entirely. This is not
particularly secure, but if someone has uploaded malicious code to MELPA inside a theme, I have bigger problems. (Besides, Emacs is
not a secure system, and I see no need to try overmuch to make it one.)

#+begin_src emacs-lisp
     (setq custom-safe-themes t)
#+end_src

By default, the list of recent files gets cluttered up with the contents of downloaded packages. It comes with Emacs, so there's no ~use-package~ call required.

#+begin_src emacs-lisp
     (require 'recentf)
     (add-to-list 'recentf-exclude "\\elpa")
#+end_src

Emoji don't work on Emacs versions < 27 (aside from the Mitsuharu Yamamoto emacs-mac port), and for those greater than 27 we seem to
need this. A fun fact about this: that commented parenthesis is to work around an inscrutable parsing bug associated with the ~<~ in
~version<~ that breaks the elisp indentation mode. Emacs!

#+begin_src emacs-lisp
     (if ( version< "27.0" emacs-version ) ; )
         (set-fontset-font "fontset-default" 'unicode "Apple Color Emoji" nil 'prepend)
       (warn "This Emacs version is too old to properly support emoji."))
#+end_src

There are a great many keybindings that are actively hostile, in that they are bound to useless or obsolete functions that are
really easy to trigger accidentally.

#+begin_src emacs-lisp
     (unbind-key "C-x C-f") ;; find-file-read-only
     (unbind-key "C-x C-d") ;; list-directory
     (unbind-key "C-z") ;; suspend-frame
     (unbind-key "M-o") ;; facemenu-mode
     (unbind-key "<mouse-2>") ;; pasting with mouse-wheel click
     (unbind-key "<C-wheel-down>") ;; text scale adjust
     (unbind-key "<C-wheel-up>") ;; ditto
     (unbind-key "s-n") ;; make-frame
#+end_src

The out-of-the-box treatment of whitespace is unfortunate, but fixable.

#+begin_src emacs-lisp
     (add-hook 'before-save-hook #'delete-trailing-whitespace)
     (setq require-final-newline t)
#+end_src


Emacs is also in love with showing you its NEWS file; it's bound to like four different keybindings. Overriding the function makes
it a no-op. You might say… no news is good news. For that matter, we can elide more GNU agitprop.

#+begin_src emacs-lisp
     (defalias 'view-emacs-news 'ignore)
     (defalias 'describe-gnu-project 'ignore)
#+end_src

Undo has always been problematic for me in Emacs. The beauty of undo-tree is that it means that, once you've typed something into a
buffer, you'll always be able to get it back. At least in theory. undo-tree has long-standing data loss bugs that are unlikely to be
fixed. But no other package provodes a comparable experience.

#+begin_src emacs-lisp
     (use-package undo-tree
       :diminish
       :bind (("C-c _" . undo-tree-visualize))
       :config
       (global-undo-tree-mode +1)
       (unbind-key "M-_" undo-tree-map))
#+end_src

It's 2020, we don't paste with mouse-wheel-click anymore.

I define a couple of my own configuration variables with ~defvar~, and no matter how many times I mark the variable as safe, it warns me every time I set it in the ~.dir-locals~ file. Disabling these warnings is probably (?) the right thing to do.

#+begin_src emacs-lisp
     (setq enable-local-variables :all)
#+end_src

Disable line numbers for some modes
#+begin_src emacs-lisp
     ;; Disable line numbers for some modes
     (dolist (mode '(org-mode-hook
                     term-mode-hook
                     shell-mode-hook
                     treemacs-mode-hook
                     eshell-mode-hook))
       (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

