config/general.org
** Evil
This configuration uses evil-mode for a Vi-like modal editing experience. general.el is used for easy keybinding configuration that
integrates well with which-key. evil-collection is used to automatically configure various Emacs modes with Vi-like keybindings for
evil-mode.

#+begin_src emacs-lisp
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general
    :after evil
    :config
    (general-create-definer mus/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix ","
      :global-prefix "C-,")

    (mus/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")
      "ecf" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/config/general.org")))))

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump t)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

  (use-package evil-commentary
    :after evil
    :config
    (evil-commentary-mode))

#+end_src

** OSX fix
There is some path issues when using Mac OSX. The following fixes the issues

#+begin_src emacs-lisp

  (use-package exec-path-from-shell)

  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))

  (setq mac-option-modifier nil)
  (setq mac-command-modifier 'meta)

  (when (string= system-type "darwin")
    (setq dired-use-ls-dired t
          insert-directory-program "/opt/homebrew/bin/gls"
          dired-listing-switches "-aBhl --group-directories-first"))
  ;; (when (equal system-type 'darwin)
  ;;  (setq insert-directory-program "/opt/homebrew/bin/gls"))


#+end_src

** Visual
I am using the [[https://github.com/tonsky/FiraCode][Fira Code]] and [[https://fonts.google.com/specimen/Cantarell][Cantarell]] fonts for this configuration which will more than likely need to be installed on your machine.  Both can usually be found in the various Linux distro package managers or downloaded from the links above.

#+begin_src emacs-lisp

     (set-face-attribute 'default nil :font "Fira Code" :height mus/default-font-size)

     ;; Set the fixed pitch face
     (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height mus/default-font-size)

     ;; Set the variable pitch face
     ;; (set-face-attribute 'variable-pitch nil :font "Cantarell" :height mus/default-variable-font-size :weight 'regular)
     (set-face-attribute 'variable-pitch nil :font "ETBembo" :height mus/default-variable-font-size :weight 'thin)


     (use-package all-the-icons)

     (use-package all-the-icons-dired
       :after all-the-icons
       :hook (dired-mode . all-the-icons-dired-mode))

#+end_src

Every Emacs window should, by default occupy all the screen space it can.

#+begin_src emacs-lisp

     (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

Set a better title bar for osx

#+begin_src emacs-lisp

     (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
     (add-to-list 'default-frame-alist '(ns-appearance . dark))
     (setq frame-title-format nil)
     (setq ns-use-proxy-icon nil)

#+end_src

Window chrome both wastes space and looks unappealing.

#+begin_src emacs-lisp
     (when (window-system)
       (menu-bar-mode -1)
       (tool-bar-mode -1)
       (scroll-bar-mode -1)
       (tooltip-mode -1))
#+end_src

I use the [[https://github.com/hlissner/emacs-doom-themes][Doom Emacs themes]], which are gorgeous.

#+begin_src emacs-lisp
     (use-package doom-themes
       :config
       (let ((chosen-theme 'doom-dracula))
         (doom-themes-visual-bell-config)
         (doom-themes-org-config)
         (setq doom-challenger-deep-brighter-comments t
               doom-challenger-deep-brighter-modeline t
               doom-dark+-blue-modeline nil)
         (load-theme chosen-theme)))
#+end_src

Most major modes pollute the modeline, so we pull in diminish.el to quiesce them.

#+begin_src emacs-lisp
     (use-package diminish
       :config (diminish 'eldoc-mode))
#+end_src

The default modeline is pretty uninspiring, and doom-modeline doesn't appear to be particularly slow.

#+begin_src emacs-lisp
     (use-package doom-modeline
       :ensure t
       :init
       :config
       (doom-modeline-mode 1)
       (setq doom-modeline-modal-icon t)
       (setq doom-modeline-lsp t))
#+end_src

I find it useful to have a slightly more apparent indicator of which buffer is active at the moment.

#+begin_src emacs-lisp
     (use-package dimmer
       :custom (dimmer-fraction 0.1)
       :config (dimmer-mode))
#+end_src

Highlighting the closing/opening pair associated with a given parenthesis is essential. Furthermore, parentheses should be delimited
by color. I may be colorblind, but it's good enough, usually.

#+begin_src emacs-lisp
     (show-paren-mode)

     (use-package rainbow-delimiters
       :hook ((prog-mode . rainbow-delimiters-mode)))
#+end_src

It's nice to have the option to center a window, given the considerable size of my screen.

#+begin_src emacs-lisp
     (use-package centered-window
       :ensure t
       :custom
       (cwm-centered-window-width 180))
#+end_src

Having indentation highlights can help with Haskell and YAML and other languages where indentation is crucial and sometimes difficult to follow in long lines.

#+begin_src emacs-lisp
     (use-package highlight-indent-guides)
#+end_src


[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for
the prefix. For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame
displaying all of the bindings under that prefix and which command they run. This is very useful for learning the possible key bindings
in the mode of your current buffer.

#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src


*** Tree-sitter

As part of my day job, I hack on the [[https://tree-sitter.github.io][~tree-sitter~]] parsing
toolkit. Pleasingly enough, the parsers generated by ~tree-sitter~
can be used to spruce up syntax highlighting within Emacs: for
example, highlighting Python with ~emacs-tree-sitter~ will
correctly highlight code inside format strings, which is really
quite useful.

#+begin_src emacs-lisp
      ;; (use-package tree-sitter
      ;;   :hook ((ruby-mode . tree-sitter-hl-mode)
      ;;          (js-mode . tree-sitter-hl-mode)
      ;;          (typescript-mode . tree-sitter-hl-mode)
      ;;          (go-mode . tree-sitter-hl-mode)))
      ;; (use-package tree-sitter-langs)
#+end_src

** Text manipulation
The ~fill-paragraph~ (~M-q~) command can be useful for formatting long text lines in a pleasing matter. I don't do it in every
document, but when I do, I want more columns than the default *:70*.

#+begin_src emacs-lisp
     (setq-default fill-column 135)
#+end_src

Parenthesis matching is one of the flaws in my Emacs setup as of this writing. I know that there are a lot of options out
there---~paredit~, ~smartparens~, etc.---but I haven't sat down and really capital-L Learned a better solution than the
TextMate-style bracket completion (which Emacs calls, somewhat fancifully, 'electric').

#+begin_src emacs-lisp
     (electric-pair-mode)
     (add-function :before-until electric-pair-inhibit-predicate (lambda (c) (eq c ?<)))
#+end_src

Some rando string and list manipulation libraries: [[https://github.com/magnars/s.el][s.el]] [[https://github.com/magnars/dash.el][dash.el]]

#+begin_src emacs-lisp
     (use-package s)
     (use-package dash)
#+end_src

** Org mode
is one of the hallmark features of Emacs. It is a rich document editor, project planner, task and time tracker, blogging engine, and
literate coding utility all wrapped up in one package.
*** Better Font Faces
The =mus/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most
cases so that it looks more like we're editing a document in =org-mode=. We switch back to fixed width (monospace) fonts for code
blocks and tables so that they display correctly.

#+begin_src emacs-lisp
  (defun mus/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "ETBembo" :weight 'bold :height (cdr face)))


    (require 'org-indent)

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way

    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-indent nil   :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
#+end_src

