config/general.org
*** basic configuration
This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates. There's a
lot to unpack in here so I'd recommend watching the videos for [[https://youtu.be/VcgjTEa0kU4][Part 5]] and [[https://youtu.be/PNE-mgkZ6HM][Part 6]] for a full explanation.

#+begin_src emacs-lisp
  (defun mus/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :pin org
    :hook (org-mode . mus/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")

    (setq org-src-tab-acts-natively nil)
    (mus/org-font-setup))
#+end_src

*** Nicer Heading Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control. Another option for
this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp
      (use-package org-bullets
        :hook (org-mode . org-bullets-mode)
        :custom
        (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

*** Center Org Buffers
We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the
buffer horizontally to seem more like you are editing a document. This is really a matter of personal preference so you can remove
the block below if you don't like the behavior.

#+begin_src emacs-lisp
      (defun mus/org-mode-visual-fill ()
        (setq visual-fill-column-width 135
              visual-fill-column-center-text t)
        (visual-fill-column-mode 1))

      (use-package visual-fill-column
        :hook (org-mode . mus/org-mode-visual-fill))
#+end_src

*** Configure Babel Languages
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like
to use. [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
      (with-eval-after-load 'org
        (org-babel-do-load-languages
         'org-babel-load-languages
         '((emacs-lisp . t)
           (python . t)))

        (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

*** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with
=org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=. For example, to insert an empty
=emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be
the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

#+begin_src emacs-lisp
      (with-eval-after-load 'org
        ;; This is needed as of Org 9.2
        (require 'org-tempo)

        (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
        (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
        (add-to-list 'org-structure-template-alist '("py" . "src python")))
#+end_src

*** Evil bindings

quickfix for a =evil-redirect-digit-argument= error. See [[https://github.com/Somelauw/evil-org-mode/issues/93#issuecomment-950306532][github issue]].

#+begin_src emacs-lisp
      ;; (fset 'evil-redirect-digit-argument 'ignore)

      ;; (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
      ;; (evil-define-key 'motion 'evil-org-mode
      ;;   (kbd "0") 'evil-org-beginning-of-line)
#+end_src


#+begin_src emacs-lisp
    (use-package evil-org
      :after org
      :hook ((org-mode . evil-org-mode)
             (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional))))))

    (mus/leader-keys
     "o"   '(:ignore t :which-key "org mode")
     "oi"  '(:ignore t :which-key "insert")
     "oil" '(org-insert-link :which-key "insert link")
     "on"  '(org-toggle-narrow-to-subtree :which-key "toggle narrow"))
#+end_src

** File Management
*** Dired
Dired is a built-in file manager for Emacs that does some pretty amazing things!  Here are some key bindings you should try out:
**** Key Bindings
***** Navigation
*Emacs* / *Evil*
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "other" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes!)

***** Marking files

- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!

***** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*Power command*: =C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

***** Deleting files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

***** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

***** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs

**** Configuration

#+begin_src emacs-lisp

    (use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :bind (("C-x C-j" . dired-jump))
      :custom (
               (if (eq system-type 'darwin)
                   (insert-directory-program "gls" dired-use-ls-dired t))
                 ;; (dired-listing-switches "-al --group-directories-first")
                 (dired-listing-switches "-agho --group-directories-first"))
               :config
               (evil-collection-define-key 'normal 'dired-mode-map
                 "h" 'dired-single-up-directory
                 "l" 'dired-single-buffer))

    (use-package dired-single
      :commands (dired dired-jump))

    ;; (use-package all-the-icons-dired
    ;;   :hook (dired-mode . all-the-icons-dired-mode))

    ;; (use-package dired-open
    ;;   :commands (dired dired-jump)
    ;;   :config
    ;;   ;; Doesn't work as expected!
    ;;   ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    ;;   (setq dired-open-extensions '(("png" . "feh")
    ;;                                 ("mkv" . "mpv"))))

    (use-package dired-hide-dotfiles
      :hook (dired-mode . dired-hide-dotfiles-mode)
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
        "H" 'dired-hide-dotfiles-mode))

#+end_src

** IDE features
*** Git

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :bind ("C-M-;" . magit-status)
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package magit-todos
    :defer t)
#+end_src

*** Workspaces

#+begin_src emacs-lisp
  (use-package perspective
    :demand t
    :bind (("C-M-k" . persp-switch)
           ("C-M-n" . persp-next)
           ("C-x k" . persp-kill-buffer*))
    :custom
    (persp-initial-frame-name "Main")
    :config
    ;; Running `persp-mode' multiple times resets the perspective list...
    (unless (equal persp-mode t)
      (persp-mode)))
#+end_src

*** Terminal
**** Vterm
is an improved terminal emulator package which uses a compiled native module to interact with the underlying terminal
applications. This enables it to be much faster than term-mode and to also provide a more complete terminal emulation experience.

Make sure that you have the necessary dependencies installed before trying to use vterm because there is a module that will need to be
compiled before you can use it successfully.

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :config
    ;;(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    (setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))
#+end_src

*** Projectile
Most every nontrivial package provides projectile integration in some form or fashion.

#+begin_src emacs-lisp
      (defun mus/switch-project-action ()
        "Switch to a workspace with the project name."
        (persp-switch (projectile-project-name))
        ;; (projectile-dired)
        ;; (magit-status)
        )
        (use-package projectile
          :diminish
          ;; :bind (("C-c k" . #'projectile-kill-buffers)
          ;;       ("C-c M" . #'projectile-compile-project))
          :custom
          (projectile-completion-system 'ivy)
          (projectile-enable-caching t)
          :config (projectile-mode)
          :init
          (setq projectile-switch-project-action #'mus/switch-project-action)
          ;; (setq counsel-projectile-switch-project-action #'mus/switch-project-action)
          )
#+end_src

