config/general.el

(defun mus/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  :pin org
  :hook (org-mode . mus/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")

(setq org-src-tab-acts-natively nil)
  (mus/org-font-setup))

(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(defun mus/org-mode-visual-fill ()
  (setq visual-fill-column-width 135
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . mus/org-mode-visual-fill))

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))

;; (fset 'evil-redirect-digit-argument 'ignore)

;; (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
;; (evil-define-key 'motion 'evil-org-mode
;;   (kbd "0") 'evil-org-beginning-of-line)

(use-package evil-org
  :after org
  :hook ((org-mode . evil-org-mode)
         (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional))))))

(mus/leader-keys
 "o"   '(:ignore t :which-key "org mode")
 "oi"  '(:ignore t :which-key "insert")
 "oil" '(org-insert-link :which-key "insert link")
 "on"  '(org-toggle-narrow-to-subtree :which-key "toggle narrow"))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom (
           (if (eq system-type 'darwin)
               (insert-directory-program "gls" dired-use-ls-dired t))
             ;; (dired-listing-switches "-al --group-directories-first")
             (dired-listing-switches "-agho --group-directories-first"))
           :config
           (evil-collection-define-key 'normal 'dired-mode-map
             "h" 'dired-single-up-directory
             "l" 'dired-single-buffer))

(use-package dired-single
  :commands (dired dired-jump))

;; (use-package all-the-icons-dired
;;   :hook (dired-mode . all-the-icons-dired-mode))

;; (use-package dired-open
;;   :commands (dired dired-jump)
;;   :config
;;   ;; Doesn't work as expected!
;;   ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
;;   (setq dired-open-extensions '(("png" . "feh")
;;                                 ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(use-package magit
  :ensure t
  :bind ("C-M-;" . magit-status)
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package magit-todos
  :defer t)

(use-package perspective
  :demand t
  :bind (("C-M-k" . persp-switch)
         ("C-M-n" . persp-next)
         ("C-x k" . persp-kill-buffer*))
  :custom
  (persp-initial-frame-name "Main")
  :config
  ;; Running `persp-mode' multiple times resets the perspective list...
  (unless (equal persp-mode t)
    (persp-mode)))

(use-package vterm
  :commands vterm
  :config
  ;;(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
  (setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
  (setq vterm-max-scrollback 10000))

(defun mus/switch-project-action ()
  "Switch to a workspace with the project name."
  (persp-switch (projectile-project-name))
  ;; (projectile-dired)
  ;; (magit-status)
  )
  (use-package projectile
    :diminish
    ;; :bind (("C-c k" . #'projectile-kill-buffers)
    ;;       ("C-c M" . #'projectile-compile-project))
    :custom
    (projectile-completion-system 'ivy)
    (projectile-enable-caching t)
    :config (projectile-mode)
    :init
    (setq projectile-switch-project-action #'mus/switch-project-action)
    ;; (setq counsel-projectile-switch-project-action #'mus/switch-project-action)
    )

(use-package ivy
  :diminish
  :custom
  (ivy-height 30)
