config/general.org
*** Ivy, counsel, and swiper
Now that Helm And with ivy-rich, things even look nice. counsel provides nice UI chrome for built-in commands, counsel-projectile
provides project integration, and amx provides most-recently-used information and keeps track of which commands I use and which I
don’t.

#+begin_src emacs-lisp
      (use-package ivy
        :diminish
        :custom
        (ivy-height 30)
        (ivy-use-virtual-buffers nil)
        (ivy-use-selectable-prompt t)
        :config
        (ivy-mode 1)
        :bind (("C-c C-r" . #'ivy-resume)
               ("C-c s"   . #'swiper-thing-at-point)
               ("C-s"     . #'swiper)))

      (use-package ivy-rich
        :custom
        (ivy-virtual-abbreviate 'full)
        (ivy-rich-switch-buffer-align-virtual-buffer nil)
        (ivy-rich-path-style 'full)
        :config
        (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
        (ivy-rich-mode))

      (use-package counsel
        :init
        (counsel-mode 1)
        :diminish
        :config
        (mus/leader-keys
          "i" 'counsel-imenu
          "f" 'counsel-find-file
          "s" 'counsel-projectile-rg
          "x" 'counsel-M-x
          "b" 'persp-counsel-switch-buffer))

      (use-package counsel-projectile
        :config
        (evil-define-key 'normal global-map (kbd "C-p")     'counsel-projectile)
        ;; (evil-define-key 'normal global-map (kbd "C-S-p")   'counsel-projectile-switch-project)
        (evil-define-key 'normal global-map (kbd "C-S-p")   'projectile-switch-project))

      (use-package smex)
#+end_src

*** Flycheck
Flycheck performs in-buffer highlighting of errors and warnings, and is superior on many axes to the builtin flymake mode. The only
configuration it needs is to add [[https://github.com/amperser/proselint][~proselint~]] support and to disable the documentation checking in org-src buffers.

#+begin_src emacs-lisp
      (use-package flycheck
        :after org
        :hook
        (org-src-mode . disable-flycheck-for-elisp)
        :custom
        (flycheck-emacs-lisp-initialize-packages t)
        (flycheck-display-errors-delay 0.1)
        :config
        (global-flycheck-mode)
        (flycheck-set-indication-mode 'left-margin)

        (defun disable-flycheck-for-elisp ()
          (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

        (add-to-list 'flycheck-checkers 'proselint)
        (setq-default flycheck-disabled-checkers '(haskell-stack-ghc)))

      (use-package flycheck-inline
        :disabled
        :config (global-flycheck-inline-mode))
#+end_src

***  Flyspell

#+begin_src emacs-lisp
    (use-package flyspell
      :ensure t
      :defer t
      :hook ((org-mode . flyspell-mode)
             (markdown-mode . flyspell-mode))
      :init
      :config

      (use-package flyspell-correct
        :after flyspell
        :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

      (use-package flyspell-correct-ivy
        :after flyspell-correct)


      (use-package flyspell-lazy
        :after flyspell
        :config
        (setq flyspell-lazy-idle-seconds 1
              flyspell-lazy-window-idle-seconds 3)
        (flyspell-lazy-mode 1)))
#+end_src

*** Searching
deadgrep is the bee’s knees for project-wide search, as it uses ripgrep.
#+begin_src emacs-lisp
      (use-package deadgrep
        :ensure t)
#+end_src

*** Autocomplete
Completion in Emacs is sort of a fraught enterprise, given the existence of pcomplete, hippie-expand, and complete.el. company is
the least problematic and most modern of these alternatives, though it’s kind of a bear to configure. Its interface is not so nice
by default but all the frontends flicker terribly if you’re typing quickly, which is just spectacularly distracting.

#+begin_src emacs-lisp
      (use-package company
        :diminish
        :bind (("C-." . #'company-capf))
        :bind (:map company-active-map
               ("C-n" . #'company-select-next)
               ("C-p" . #'company-select-previous))
        :hook (prog-mode . company-mode)
        :custom
        (company-dabbrev-downcase nil "Don't downcase returned candidates.")
        (company-show-numbers t "Numbers are helpful.")
        (company-tooltip-limit 20 "The more the merrier.")
        (company-tooltip-idle-delay 0.4 "Faster!")
        (company-async-timeout 20 "Some requests can take a long time. That's fine.")
        (company-idle-delay 1.5 "Default is way too low.")
        :config)
#+end_src

*** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that
speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]]. Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your
language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added. I *highly
recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l=
in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp
  (defun mus/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred lsp-execute-code-action)
    :hook ((lsp-mode . lsp-enable-which-key-integration)
           (lsp-mode . lsp-diagnostics-modeline-mode))
    :bind(("C-c C-c" . #'lsp-execute-code-action)
          ("C-c i" . #'lsp-format-buffer))
    :init
    (setq lsp-keymap-prefix "C-c l")
    :custom
    (lsp-headerline-breadcrumb-enable nil)
    (lsp-eldoc-enable-hover nil)
    (lsp-diagnostics-modeline-scope :project)
    (lsp-file-watch-threshold 5000)
    (lsp-response-timeout 2)
    (lsp-ui-doc-mode nil)
    (lsp-enable-file-watchers nil)
    (lsp-auto-guess-root t)
     (lsp-eldoc-enable-hover t)
    :config
    (define-key evil-motion-state-map (kbd "K") 'lsp-describe-thing-at-point))
#+end_src


[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

    (use-package lsp-ui
      :hook (lsp-mode . lsp-ui-mode)
      :custom
      (lsp-ui-sideline-enable t)
      (lsp-ui-sideline-show-hover nil)
      (lsp-ui-sideline-show-code-actions nil)
      (lsp-ui-doc-mode nil)
      (lsp-ui-doc-enable nil)
      ;; (lsp-ui-doc-position 'bottom)
      :after lsp-mode)

#+end_src


[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic
messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left
side of your screen in your editor.

#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp-mode)
#+end_src


[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code. When you run these commands, a prompt
will appear in the minibuffer allowing you to type part of the name of a symbol in your code. Results will be populated in the
minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp
  (use-package lsp-ivy
    :after ivy lsp-mode)


     (use-package company-lsp
      :disabled
      :custom (company-lsp-enable-snippet t)
      :after (company lsp-mode))

#+end_src

*** Snippets
#+begin_src emacs-lisp
      (use-package yasnippet
        :defer 3 ;; takes a while to load, so do it async
        :diminish yas-minor-mode
        :config
        (yas-global-mode)
        (define-key yas-minor-mode-map (kbd "<escape>") 'yas-exit-snippet)
        :custom (yas-prompt-functions '(yas-completing-prompt)))

        (use-package yasnippet-snippets
  :ensure t)
#+end_src

** Language support
