config/general.el
  (ivy-use-virtual-buffers nil)
  (ivy-use-selectable-prompt t)
  :config
  (ivy-mode 1)
  :bind (("C-c C-r" . #'ivy-resume)
         ("C-c s"   . #'swiper-thing-at-point)
         ("C-s"     . #'swiper)))

(use-package ivy-rich
  :custom
  (ivy-virtual-abbreviate 'full)
  (ivy-rich-switch-buffer-align-virtual-buffer nil)
  (ivy-rich-path-style 'full)
  :config
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
  (ivy-rich-mode))

(use-package counsel
  :init
  (counsel-mode 1)
  :diminish
  :config
  (mus/leader-keys
    "i" 'counsel-imenu
    "f" 'counsel-find-file
    "s" 'counsel-projectile-rg
    "x" 'counsel-M-x
    "b" 'persp-counsel-switch-buffer))

(use-package counsel-projectile
  :config
  (evil-define-key 'normal global-map (kbd "C-p")     'counsel-projectile)
  ;; (evil-define-key 'normal global-map (kbd "C-S-p")   'counsel-projectile-switch-project)
  (evil-define-key 'normal global-map (kbd "C-S-p")   'projectile-switch-project))

(use-package smex)

(use-package flycheck
  :after org
  :hook
  (org-src-mode . disable-flycheck-for-elisp)
  :custom
  (flycheck-emacs-lisp-initialize-packages t)
  (flycheck-display-errors-delay 0.1)
  :config
  (global-flycheck-mode)
  (flycheck-set-indication-mode 'left-margin)

  (defun disable-flycheck-for-elisp ()
    (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

  (add-to-list 'flycheck-checkers 'proselint)
  (setq-default flycheck-disabled-checkers '(haskell-stack-ghc)))

(use-package flycheck-inline
  :disabled
  :config (global-flycheck-inline-mode))

(use-package flyspell
  :ensure t
  :defer t
  :hook ((org-mode . flyspell-mode)
         (markdown-mode . flyspell-mode))
  :init
  :config

  (use-package flyspell-correct
    :after flyspell
    :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

  (use-package flyspell-correct-ivy
    :after flyspell-correct)


  (use-package flyspell-lazy
    :after flyspell
    :config
    (setq flyspell-lazy-idle-seconds 1
          flyspell-lazy-window-idle-seconds 3)
    (flyspell-lazy-mode 1)))

(use-package deadgrep
  :ensure t)

(use-package company
  :diminish
  :bind (("C-." . #'company-capf))
  :bind (:map company-active-map
         ("C-n" . #'company-select-next)
         ("C-p" . #'company-select-previous))
  :hook (prog-mode . company-mode)
  :custom
  (company-dabbrev-downcase nil "Don't downcase returned candidates.")
  (company-show-numbers t "Numbers are helpful.")
  (company-tooltip-limit 20 "The more the merrier.")
  (company-tooltip-idle-delay 0.4 "Faster!")
  (company-async-timeout 20 "Some requests can take a long time. That's fine.")
  (company-idle-delay 1.5 "Default is way too low.")
  :config)

;(use-package lsp-mode
;  :commands (lsp lsp-execute-code-action)
;  :hook ((go-mode . lsp-deferred)
;         (lsp-mode . lsp-enable-which-key-integration)
;         (lsp-mode . lsp-diagnostics-modeline-mode))
;  :bind ("C-c C-c" . #'lsp-execute-code-action)
;  :custom
;  (lsp-diagnostics-modeline-scope :project)
;  (lsp-file-watch-threshold 5000)
;  (lsp-response-timeout 2)
;  (lsp-ui-doc-mode nil)
;  (lsp-enable-file-watchers nil))

;;; (use-package lsp-ui
;;;   :custom
;;;   (lsp-ui-doc-mode nil)
;;;   :after lsp-mode)

;(use-package lsp-ivy
;  :after (ivy lsp-mode))

;(use-package company-lsp
;  :disabled
;  :custom (company-lsp-enable-snippet t)
;  :after (company lsp-mode))

(defun mus/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred lsp-execute-code-action)
  :hook ((lsp-mode . lsp-enable-which-key-integration)
         (lsp-mode . lsp-diagnostics-modeline-mode))
  :bind(("C-c C-c" . #'lsp-execute-code-action)
        ("C-c i" . #'lsp-format-buffer))
  :init
  (setq lsp-keymap-prefix "C-c l")
  :custom
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-eldoc-enable-hover nil)
  (lsp-diagnostics-modeline-scope :project)
  (lsp-file-watch-threshold 5000)
  (lsp-response-timeout 2)
  (lsp-ui-doc-mode nil)
  (lsp-enable-file-watchers nil)
  (lsp-auto-guess-root t)
   (lsp-eldoc-enable-hover t)
  :config
  (define-key evil-motion-state-map (kbd "K") 'lsp-describe-thing-at-point))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-sideline-enable t)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-sideline-show-code-actions nil)
  (lsp-ui-doc-mode nil)
  (lsp-ui-doc-enable nil)
  ;; (lsp-ui-doc-position 'bottom)
  :after lsp-mode)

(use-package lsp-treemacs
  :after lsp-mode)

(use-package lsp-ivy
  :after ivy lsp-mode)


   (use-package company-lsp
    :disabled
    :custom (company-lsp-enable-snippet t)
    :after (company lsp-mode))

(use-package yasnippet
      :defer 3 ;; takes a while to load, so do it async
      :diminish yas-minor-mode
      :config
      (yas-global-mode)
      (define-key yas-minor-mode-map (kbd "<escape>") 'yas-exit-snippet)
      :custom (yas-prompt-functions '(yas-completing-prompt)))

      (use-package yasnippet-snippets
:ensure t)

(with-eval-after-load 'projectile
