config/general.el
  (add-to-list 'projectile-project-root-files "Gemfile"))

(use-package ruby-mode
  :after lsp-mode
  :hook (ruby-mode . lsp-deferred)
  :config
  (setq ruby-insert-encoding-magic-comment nil)
  (use-package inf-ruby
    :hook
    (ruby-mode . inf-ruby-minor-mode)
    :init
    (add-hook 'compilation-filter-hook 'inf-ruby-auto-enter)))

(use-package rvm
  :diminish
  :config
  (rvm-use-default))


(use-package projectile-rails
  ;; :ensure t
  :commands (projectile-rails-on)
  ;; :after projectile
  :hook ((ruby-mode inf-ruby-mode projectile-rails-server-mode) . projectile-rails-mode)
  :hook ((projectile-mode) . projectile-rails-on)
  :config
  (define-key projectile-rails-mode-map (kbd "C-c r") 'projectile-rails-command-map))

(use-package lispy
  :hook ((emacs-lisp-mode . lispy-mode)
         (scheme-mode . lispy-mode)))

(use-package lispyville
  :hook ((lispy-mode . lispyville-mode))
  :config
  (lispyville-set-key-theme '(operators c-w additional
                                        additional-movement slurp/barf-cp
                                        prettify)))

(with-eval-after-load "projectile"
  (add-to-list 'projectile-project-root-files-bottom-up "pubspec.yaml")
  (add-to-list 'projectile-project-root-files-bottom-up "BUILD"))

  (use-package lsp-dart
:ensure t
:hook (dart-mode . lsp))

(use-package dart-mode
  :after lsp-mode
  :hook (dart-mode . lsp-deferred))

(use-package flutter
  :after dart-mode
  :bind (:map dart-mode-map
              ("C-M-x" . #'flutter-run-or-hot-reload))
  :custom
  (flutter-sdk-path "/home/mads/development/flutter"))

(provide 'init)
